# IdeaStatiCa.ConnectionApi.Model.FemElement
Provides information about FEM element

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Type** | **int** | Type of the finite element  1 - triangular element 2D  2 - quadrilateral element 2D | [optional]
**Vertices** | **List&lt;int&gt;** | Get list of vertices of the fem element | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)